app/views/pages/home.html.erb

SELECT "users".* FROM "users"
---
            <tbody id="myTable">
              <% User.all.each do |user| %>