app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 17], ["id", 19]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 14], ["id", 15]]
---
  def edit_multiple
    if params[:commit] == "Delete"
      User.where(id: params[:user_ids]).destroy_all
    elsif params[:commit] == "Lock"
      User.where(id: params[:user_ids]).each do |user_to_lock|
        user_to_lock.lock_access!
      end
    elsif params[:commit] == "Unlock"
      User.where(id: params[:user_ids]).each do |user_to_unlock|